// @flow

import type {LangDataType} from '../type';

export const ruRu: LangDataType = {
    /* eslint-disable id-match, max-len, id-length */
    ONLINE_GAME: 'Сетевая Игра',
    OFFLINE_GAME: 'Локальная Игра',
    SETTINGS: 'Настройки',
    LANGUAGE: 'Язык',
    CREATE_GAME: 'Создать Игру',
    JOIN_GAME: 'Подключиться к Игре',
    MAP: 'Карта',
    MAPS: 'Карты',
    PLAYER: 'Игрок',
    PLAYERS: 'Игроки',
    MESSAGE__NO_OPEN_GAME: 'Нет доступных игр, но Вы можете создать свою\u2026',
    LOADING: 'Загрузка',
    REFRESH: 'Обновить',
    YOU: 'Вы',
    HUMAN: 'Игрок',
    ADD_HUMAN: 'Добавить Игрока',
    BOT: 'Бот',
    ADD_BOT: 'Добавить Бота',
    START: 'Старт',
    WAIT_FOR_START: 'Ожидание старта',
    CASTLE: 'Замок',

    // units name
    UNIT__SOLDIER__NAME: 'Солдат',
    UNIT__ARCHER__NAME: 'Лучник',
    UNIT__ELEMENTAL__NAME: 'Элементаль',
    UNIT__SORCERESS__NAME: 'Ведьма',
    UNIT__WISP__NAME: 'Висп',
    UNIT__DIRE_WOLF__NAME: 'Жуткий Волк',
    UNIT__GOLEM__NAME: 'Голем',
    UNIT__CATAPULT__NAME: 'Катапульта',
    UNIT__DRAGON__NAME: 'Дракон',
    UNIT__SKELETON__NAME: 'Скелет',
    UNIT__GALAMAR__NAME: 'Галамар',
    UNIT__VALADORN__NAME: 'Валадорн',
    UNIT__DEMON_LORD__NAME: 'Демон Лорд',
    UNIT__SAETH__NAME: 'Саеф',
    UNIT__CRYSTAL__NAME: 'Кристалл',
    UNIT__SAETH_HEAVENS_FURY__NAME: 'Саеф',

    // units description
    UNIT__SOLDIER__DESCRIPTION:
        'Солдаты это солидные всесторонние бойцы, которые сформируют костяк любой армии. Также солдаты - единственная единица, которая может захватывать города, приносящие золото.',
    UNIT__ARCHER__DESCRIPTION:
        'Со своими мощными луками стрелки могут атаковать на расстоянии и особенно эффективны против летающих врагов.',
    UNIT__ELEMENTAL__DESCRIPTION:
        'Элементалы это магические водяные духи. Будучи в воде, Элементалы быстрее передвигаются и лучше защищаются.',
    UNIT__SORCERESS__DESCRIPTION:
        'Натасканные в использовании магии, Ведьмы слабы в ближнем бою. Однако, их способность к вызову боевых скелетов из мертвых войск может стать решающей в битве.',
    UNIT__WISP__DESCRIPTION:
        'Эти мистические существа чистого света излучают ауру, которая усиливает способности к атаке у ближайших дружественных единиц. В ближнем бою они особенно смертельны против скелетов.',
    UNIT__DIRE_WOLF__DESCRIPTION:
        'Жуткие Волки - опасные охотники, которые передвигаются стаями. Будьте осторожны - их укусы ядовиты, что уменьшает и атаку, и защиту на один ход.',
    UNIT__GOLEM__DESCRIPTION:
        'Големы - это древние существа - медленны, но необычайно сильны в защите. Голема, расположенного в здании или хорошо защищенной горе очень сложно победить.',
    UNIT__CATAPULT__DESCRIPTION:
        'Катапульты приносят опустошение везде, куда достанут со своей гигантской зоной атаки. Однако, они относительная неподвижность и неспособность атаковать вблизи делают их уязвимыми, так что защищайте их хорошо. Катапульты могут передвигаться и атаковать в течении хода, но только что-нибудь одно за ход.',
    UNIT__DRAGON__DESCRIPTION:
        'Эти грациозные летающие твари правят над горами с древнейших времен. Они чрезвычайно подвижны, а так же смертельно опасны в атаках на земле, воздухе и в море.',
    UNIT__SKELETON__DESCRIPTION:
        'Вызванные ведьмами, эти безжизненные воины сильны как солдаты и смертельные оппоненты на любом поле боя.',
    UNIT__GALAMAR__DESCRIPTION:
        'Галамар (командир) очень силен в атаке и защите. Командиры могут также занимать замки, чтобы производить войска, и их можно оживлять в замке, если они умрут в битве.',
    UNIT__VALADORN__DESCRIPTION:
        'Валадорн (командир) очень силен в атаке и защите. Командиры могут также занимать замки, чтобы производить войска, и их можно оживлять в замке, если они умрут в битве.',
    UNIT__DEMON_LORD__DESCRIPTION:
        'Демон лорд (командир) очень силен в атаке и защите. Командиры могут также занимать замки, чтобы производить войска, и их можно оживлять в замке, если они умрут в битве.',
    UNIT__SAETH__DESCRIPTION:
        'Саеф (командир) очень силен в атаке и защите. Командиры могут также занимать замки, чтобы производить войска, и их можно оживлять в замке, если они умрут в битве.',
    UNIT__CRYSTAL__DESCRIPTION:
        'Эти легендарные кристаллы были изначально выкопаны из руин Античной Цитадели. Мало что известно об их силе, за исключением того, что они, по слухам, могут защитить королевство, а также обладают силой, чтобы уничтожить его.',
    UNIT__SAETH_HEAVENS_FURY__DESCRIPTION:
        'Саеф (командир) очень силен в атаке и защите. Командиры могут также занимать замки, чтобы производить войска, и их можно оживлять в замке, если они умрут в битве.',

    // init app
    ENVIRONMENT_SETTING: 'Настройка окружения',
    SETTING_UP_CONNECTIONS: 'Настройка соединений',
    LOADING_TEXTURES: 'Загрузка текстур',
    PREPARATION_OF_IMAGES: 'Подготовка изображений',

    // spec symbols
    SPACE: ' ',
};
